In [2]:
import pandas as pd
obj=pd.read_csv("sample1.csv")
print(obj)

  name  age  marks
0    a   16     98
1    b   12     91
2    c   10     90
3    d   19     88
4    f    6     98
5    k   18     77
6    y    9     80
7    i    7     85
8    l   17     72
9    h   14     64

In [3]:
pd.DataFrame(obj)

  name  age  marks
0    a   16     98
1    b   12     91
2    c   10     90
3    d   19     88
4    f    6     98
5    k   18     77
6    y    9     80
7    i    7     85
8    l   17     72
9    h   14     64

In [4]:
l=[10,12,15,18]
pd.Series(l)

0    10
1    12
2    15
3    18
dtype: int64

In [5]:
pd.Series(l,index=['a','b','c','d'])

a    10
b    12
c    15
d    18
dtype: int64

In [7]:
import numpy as np
a=np.array([2,3,4,7,10])
pd.Series(a)

0     2
1     3
2     4
3     7
4    10
dtype: int32

In [8]:
d={'a':1,"b":2,"c":3,"d":4,"e":5}
pd.Series(d)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
data=[("a",2),("c",5),("g",7),("k",11)]
pd.Series(data)

0     (a, 2)
1     (c, 5)
2     (g, 7)
3    (k, 11)
dtype: object

In [16]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([2,4,6,8,10])

In [18]:
s1.add(s2)

0     3
1     6
2     9
3    12
4    15
dtype: int64

In [19]:
s1.subtract(s2)

0   -1
1   -2
2   -3
3   -4
4   -5
dtype: int64

In [20]:
s1.multiply(s2)

0     2
1     8
2    18
3    32
4    50
dtype: int64

In [21]:
s1.divide(s2)

0    0.5
1    0.5
2    0.5
3    0.5
4    0.5
dtype: float64

In [22]:
s1.mod(s2)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [23]:
s1.pow(s2)

0          1
1         16
2        729
3      65536
4    9765625
dtype: int64

In [24]:
s1.le(s2)

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [25]:
s1.ge(s2)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [26]:
s1.eq(s2)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [27]:
s1+s2

0     3
1     6
2     9
3    12
4    15
dtype: int64

In [28]:
s1-s2

0   -1
1   -2
2   -3
3   -4
4   -5
dtype: int64

In [29]:
s1*s2

0     2
1     8
2    18
3    32
4    50
dtype: int64

In [30]:
s1%s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [31]:
s1/s2

0    0.5
1    0.5
2    0.5
3    0.5
4    0.5
dtype: float64

In [33]:
s1**s2

0          1
1         16
2        729
3      65536
4    9765625
dtype: int64

In [34]:
s1<s2

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [35]:
s1>s2

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [36]:
s1==s2

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [40]:
data=pd.read_excel("sample1.xlsx")
pd.DataFrame(data)

  name  age  marks
0    a   16     98
1    b   12     91
2    c   10     90
3    d   19     88
4    f    6     98
5    k   18     77
6    y    9     80
7    i    7     85
8    l   17     72
9    h   14     64

In [54]:
d={'Name':["abc","def","ghi"],'Percentage':[99,87,97],'Branch':["cse","mech","civil"]}
obj=pd.DataFrame(d)
obj

  Name  Percentage Branch
0  abc          99    cse
1  def          87   mech
2  ghi          97  civil

In [45]:
data=[("NAME","MARKS","BRANCH"),("ABC",87,"CSE"),("DEF",80,"MECH"),("GHI",99,"CSE")]
pd.DataFrame(data)

      0      1       2
0  NAME  MARKS  BRANCH
1   ABC     87     CSE
2   DEF     80    MECH
3   GHI     99     CSE

In [60]:
obj["Name"]

0    abc
1    def
2    ghi
Name: Name, dtype: object

In [55]:
obj.describe()

       Percentage
count    3.000000
mean    94.333333
std      6.429101
min     87.000000
25%     92.000000
50%     97.000000
75%     98.000000
max     99.000000

In [58]:
obj[["Name","Branch"]]

  Name Branch
0  abc    cse
1  def   mech
2  ghi  civil

In [61]:
obj.columns

Index(['Name', 'Percentage', 'Branch'], dtype='object')

In [62]:
obj.loc[obj["Name"]=="abc"]

  Name  Percentage Branch
0  abc          99    cse

In [63]:
obj.loc[obj["Branch"]=="cse"]

  Name  Percentage Branch
0  abc          99    cse

In [64]:
obj.head(2)

  Name  Percentage Branch
0  abc          99    cse
1  def          87   mech

In [65]:
obj.head()

  Name  Percentage Branch
0  abc          99    cse
1  def          87   mech
2  ghi          97  civil

In [66]:
import pandas as pd
obj=pd.read_csv("sample1.csv")
print(obj)

  name  age  marks
0    a   16     98
1    b   12     91
2    c   10     90
3    d   19     88
4    f    6     98
5    k   18     77
6    y    9     80
7    i    7     85
8    l   17     72
9    h   14     64

In [67]:
obj.head()

  name  age  marks
0    a   16     98
1    b   12     91
2    c   10     90
3    d   19     88
4    f    6     98

In [68]:
obj.tail()

  name  age  marks
5    k   18     77
6    y    9     80
7    i    7     85
8    l   17     72
9    h   14     64

In [69]:
obj.head(3)

  name  age  marks
0    a   16     98
1    b   12     91
2    c   10     90

In [71]:
#print from 5th to 8th row
obj1=obj.tail()
obj1.head(4)

  name  age  marks
5    k   18     77
6    y    9     80
7    i    7     85
8    l   17     72

In [72]:
pd.DataFrame(obj)

  name  age  marks
0    a   16     98
1    b   12     91
2    c   10     90
3    d   19     88
4    f    6     98
5    k   18     77
6    y    9     80
7    i    7     85
8    l   17     72
9    h   14     64

In [76]:
obj[["name","age","marks"][0:9:2]]

  name  marks
0    a     98
1    b     91
2    c     90
3    d     88
4    f     98
5    k     77
6    y     80
7    i     85
8    l     72
9    h     64

In [77]:
obj.sort_values("name")

  name  age  marks
0    a   16     98
1    b   12     91
2    c   10     90
3    d   19     88
4    f    6     98
9    h   14     64
7    i    7     85
5    k   18     77
8    l   17     72
6    y    9     80

In [78]:
obj.sort_values("marks")

  name  age  marks
9    h   14     64
8    l   17     72
5    k   18     77
6    y    9     80
7    i    7     85
3    d   19     88
2    c   10     90
1    b   12     91
0    a   16     98
4    f    6     98

In [82]:
obj.sort_values("marks",ascending=0)

  name  age  marks
0    a   16     98
4    f    6     98
1    b   12     91
2    c   10     90
3    d   19     88
7    i    7     85
6    y    9     80
5    k   18     77
8    l   17     72
9    h   14     64

In [84]:
obj.drop(columns="age")

  name  marks
0    a     98
1    b     91
2    c     90
3    d     88
4    f     98
5    k     77
6    y     80
7    i     85
8    l     72
9    h     64

In [85]:
pd.read_csv("sample1.csv")

  name  age  marks
0    a   16     98
1    b   12     91
2    c   10     90
3    d   19     88
4    f    6     98
5    k   18     77
6    y    9     80
7    i    7     85
8    l   17     72
9    h   14     64

In [86]:
obj["grade"]=0

In [87]:
obj

  name  age  marks  grade
0    a   16     98      0
1    b   12     91      0
2    c   10     90      0
3    d   19     88      0
4    f    6     98      0
5    k   18     77      0
6    y    9     80      0
7    i    7     85      0
8    l   17     72      0
9    h   14     64      0

In [2]:
import pandas as pd
obj=pd.read_csv("sample1.csv")
obj.shape

(10, 5)

In [4]:
obj.rename(columns={"marks":"salary"})

  name  age  salary gender   dept
0    a   16      98      f    cse
1    b   12      91      m    ece
2    c   10      90      f   mech
3    d   19      88      f  civil
4    f    6      98      m    eee
5    k   18      77      m   mech
6    y    9      80      m    cse
7    i    7      85      f    cse
8    l   17      72      f    eee
9    h   14      64      m  civil

In [1]:
import numpy as np
import pandas as pd
a={'Name':['abc','def','ghi','abd'],'perc':[90,88,72,89],'branch':['cse','ece','eee','cse']}
df=pd.DataFrame(a)
df

  Name  perc branch
0  abc    90    cse
1  def    88    ece
2  ghi    72    eee
3  abd    89    cse

In [8]:
df['age']=[19,20,23,17]
df

  Name  perc branch  age
0  abc    90    cse   19
1  def    88    ece   20
2  ghi    72    eee   23
3  abd    89    cse   17

In [11]:
df.drop(columns='perc')

  Name branch  age
0  abc    cse   19
1  def    ece   20
2  ghi    eee   23
3  abd    cse   17

In [12]:
df

  Name  perc branch  age
0  abc    90    cse   19
1  def    88    ece   20
2  ghi    72    eee   23
3  abd    89    cse   17